Revit 2026 API

# BuiltInFailuresForeignFileFailures Class

---

Failures about files saved by applications that were not developed or licensed by Autodesk.

SystemObject Autodesk.Revit.DBBuiltInFailuresForeignFileFailures

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ForeignFileFailures
```
```vb
Public NotInheritable Class ForeignFileFailures
```
```cpp
public ref class ForeignFileFailures abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ForeignFileFailures = class end
```

The BuiltInFailuresForeignFileFailures type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | ForeignFile | This file [FamilyName] was saved by an application that was not developed or licensed by Autodesk. |
|  | ForeignLink | This file [RvtLinkName] was saved by an application that was not developed or licensed by Autodesk. |

#### Reference

Autodesk.Revit.DB Namespace